export interface Sunnah {
  id: string;
  action: string;
  hadith: string;
}

export const SUNNAHS: Sunnah[] = [
  {
    id: "1",
    action: "السواك عند كل صلاة",
    hadith: "قال رسول الله ﷺ: «لولا أن أشق على أمتي لأمرتهم بالسواك عند كل صلاة»",
  },
  {
    id: "2",
    action: "قراءة سورة الملك قبل النوم",
    hadith: "قال رسول الله ﷺ: «سورة تبارك هي المانعة من عذاب القبر»",
  },
  {
    id: "3",
    action: "صلاة الضحى",
    hadith: "قال رسول الله ﷺ: «يُصْبِحُ علَى كُلِّ سُلَامَى مِن أَحَدِكُمْ صَدَقَةٌ... وَيُجْزِئُ مِن ذلكَ رَكْعَتَانِ يَرْكَعُهُما مِنَ الضُّحَى»",
  },
  {
    id: "4",
    action: "التيامن في اللباس والانتعال",
    hadith: "كان رسول الله ﷺ يُعجبه التيمُّن في تنعُّله، وترجُّله، وطُهوره، وفي شأنه كله.",
  },
  {
    id: "5",
    action: "الابتسامة",
    hadith: "قال رسول الله ﷺ: «تبسمك في وجه أخيك لك صدقة»",
  },
  {
    id: "6",
    action: "الدعاء بعد الأذان",
    hadith: "قال رسول الله ﷺ: «من قال حين يسمع النداء: اللهم رب هذه الدعوة التامة والصلاة القائمة... حلت له شفاعتي يوم القيامة»",
  },
  {
    id: "7",
    action: "الوتر قبل النوم",
    hadith: "أوصاني خليلي ﷺ بثلاث: «صيام ثلاثة أيام من كل شهر، وركعتي الضحى، وأن أوتر قبل أن أنام»",
  }
];
